# Создать модуль my_burger. В нем определить функции добавления инградиентов:
#  - булочки
#  - котлеты
#  - огурчика
#  - помидорчика
#  - майонеза
#  - сыра
# В каждой функции выводить на консоль что-то вроде "А теперь добавим ..."


#  функция булочки
def bun():
    print("Добавим булочек")


#  функция котлеты
def cutlets():
    print("А теперь добавим бифштекс из говядины")


#  функция огурчиков
def cucumbers():
    print("Еще огурчиков")


#  функция помидорчиков
def tomato():
    print("Не помешает помидорчиков")


#  функция лука
def onion():
    print("Не помешает лука")


#  функция майонеза
def mayonnaise():
    print("Нужен майонез")


#  функция сыра
def cheese():
    print("Подкинем сыра")


#  функция соус горчичный

def sauce():
    print("Подкинем горчичного соуса")


#  функция кетчуп
def ketchup():
    print("Приправим кетчупом")
