# Правила:
# Компьютер загадывает четырехзначное число, все цифры которого различны
# (первая цифра числа отлична от нуля). Игроку необходимо разгадать задуманное число.
# Игрок вводит четырехзначное число c неповторяющимися цифрами,
# компьютер сообщают о количестве «быков» и «коров» в названном числе
# «бык» — цифра есть в записи задуманного числа и стоит в той же позиции,
#       что и в задуманном числе
# «корова» — цифра есть в записи задуманного числа, но не стоит в той же позиции,
#       что и в задуманном числе
#
# Например, если задумано число 3275 и названо число 1234,
# получаем в названном числе одного «быка» и одну «корову».
# Очевидно, что число отгадано в том случае, если имеем 4 «быка».
#
# Формат ответа компьютера
# > быки - 1, коровы - 1

# Составить отдельный модуль mastermind_engine, реализующий функциональность игры.
# В mastermind_engine нужно реализовать функции:
#   загадать_число()
#   проверить_число(NN) - возвращает словарь {'bulls': N, 'cows': N}
# Загаданное число хранить в глобальной переменной.
# Обратите внимание, что строки - это список символов.

import random

holder = [0]
attempt = 0

bulls = 0


def guess_number():
    global holder

    while holder[0] == 0:
        holder = random.sample(range(9), 4)

    return holder


def check_number(guess):
    global attempt
    bulls = 0
    cows = 0
    attempt += 1
    for index_value in range(0, len(guess)):

        if int(guess[index_value]) == holder[index_value]:
            bulls += 1

        elif int(guess[index_value]) in holder:
            cows += 1

    return {'bulls': bulls, 'cows': cows}


def game_over():
    if bulls == 4:
        return attempt
